Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationServiceMismatch Property
 Attempting to connect fabrication parts from different services.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationServiceMismatch { get; }
Public Shared ReadOnly Property FabricationServiceMismatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationServiceMismatch {
	FailureDefinitionId^ get ();
}
static member FabricationServiceMismatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace